package special_class;

import java.util.Scanner;

public class test15 {
    public static void main(String[] args) {
        // 메뉴를 선택하세요
        // 1. 1번째 실행 // 게임 실행 횟수 출력
        // 1. M X N Matrix를 출력
        // 2. 좌상단->우하단 대각선 삭제 후 M X N Matrix 출력
        // 3. 좌상단->우하단 + 우상단->좌하단 대각선 삭제 후 M X N Matrix 출력
        // 4. 종료

        // 메뉴를 입력 받아 해당 프로그램 실행 후 다시 메뉴 출력
        // 1 ~ 4 이외 값 입력 받아 해당 프로그램 실행 후 다시 메뉴 출력


        // 1번 : 사용자로부터 M, N 정수를 입력 받아, M X N Matrix를 출력하세요
        // 예) M : 3, N : 2
        //   * *
        //   * *
        //   * *
        //  예외처리 : M과 N이 0 또는 음의 정수인 경우, 재입력

        // 2번: 좌상단->우하단 대각선 삭제 후 M X N Matrix 출력
        // 예) M : 3, N : 3
        //     * *
        //   *   *
        //   * *
        //  예외처리 : M과 N이 0 또는 음의 정수인 경우, 재입력


        // 3번: 좌상단->우하단 + 우상단->좌하단 대각선 삭제 후 M X N Matrix 출력
        // 예) M : 3, N : 3
        //     *
        //   *   *
        //     *
        //  예외처리 : M과 N이 0 또는 음의 정수인 경우, 재입력

        ////////////////////////////////////////////////////////////

//        Scanner sc = new Scanner(System.in);
//        int inputM = 0;
//        int inputN = 0;
//
//        // 메뉴 출력 (프로그램 실행 후 다시 메뉴 출력)
//        while ()


        // 메뉴에 따라 출력
        // 1. M X N Matrix를 출력
        // 2. 좌상단->우하단 대각선 삭제 후 M X N Matrix 출력
        // 3. 좌상단->우하단 + 우상단->좌하단 대각선 삭제 후 M X N Matrix 출력
        // 4. 종료

        // 1 ~ 4 이외 값 입력 받아 해당 프로그램 실행 후 다시 메뉴 출력


        //





    }
}
