package ArrayExam;


import java.util.Scanner;

public class LabTest2 {
    public static void main (String [] args){

    }
    // 입력 메서드


        // 학번과 국어, 영어, 수학 성적을 차례대로 입력받아서 데이터를 float형 2차원 배열에 저장
        // 학번

        // 국어


        // 영어


        // 수학


        // 합계

        // 평균



    }

    // 성적 출력 메서드

        // 데이터가 없는 경우 "입력된 학생 정보가 없습니다." 출력

            // 종료



        // 데이터를 출력



    // 삭제 메서드


        // 학번 존재 : 해당 학생의 데이터를 삭제

        // 마지막 행을 0로 초기화



        // menu 출력 하기

        // 학생 count


        // 데이터를 저장하기 위한 float형 2차원 배열을 생성

            // 4. 종료

                // 1. 학생 성적 입력

                // 2. 입력된 학생 목록 출력

                    // 현재 입력된 학생들의 성적 목록을 출력

                    // 출력 후 메뉴로 복귀.

                // 3. 학생 삭제하기




                        // 현재 입력된 학생들의 목록을 출력


                        // 삭제할 학생의 학번을 입력받음

                                // "삭제가 완료되었습니다." 메시지 출력

                                // 삭제 완료 후 업데이트된 목록 출력

                        // 학번 미존재 : "해당 학번이 존재하지 않습니다. 다시 입력해주세요." 메시지 출력


